In [1]:
import numpy as np; import pandas as pd

In [2]:
df_tips = pd.read_csv("tips.csv")

1. df_tips içindeki Payment ID column'unun son 3 rakamını çekin. Bu işlemi 3 farklı yolla da yapmaya çalışın.

In [9]:
# 1. YOL: Fonksiyon

In [5]:
def son2(x):
    return x[-2:]

In [6]:
df_tips["Payment ID"].apply(son2)

0      59
1      08
2      58
3      60
4      51
       ..
239    57
240    66
241    80
242    17
243    72
Name: Payment ID, Length: 244, dtype: object

In [8]:
# 2. YOL: Lambda Expression

In [10]:
df_tips["Payment ID"].apply(lambda x: x[-2:])

0      59
1      08
2      58
3      60
4      51
       ..
239    57
240    66
241    80
242    17
243    72
Name: Payment ID, Length: 244, dtype: object

In [12]:
# 3. YOL: Vektorize

In [13]:
df_tips["Payment ID"].str[-2:]

0      59
1      08
2      58
3      60
4      51
       ..
239    57
240    66
241    80
242    17
243    72
Name: Payment ID, Length: 244, dtype: object

2. df_tips içindeki Payer Name sütununda isim ve soy isim bilgileri bulunuyor. O sütundan sadece isim bilgileri çekin ve 'JustName' adında yeni bir column oluşturun. (Bu biraz zorlayıcı olabilir, Önce kendiniz yapmaya çalışın fakat yapamazsanız ChatGPT'ye soruyu düzgünce sorarak cevabını kod olarak alabilirsiniz, ardından döndürülen kodu anlamaya çalışmanız yeterlidir.)

In [70]:
df_tips["JustName"] = df_tips["Payer Name"].str.split().str.get(0)

In [71]:
df_tips.head(25)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,JustName
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,Christy
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,Douglas
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,Travis
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,Nathaniel
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,Tonya
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679,Erik
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985,Kristopher
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157,Robert
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820,Joseph
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775,Jerome
10,10.27,1.71,Male,No,Sun,Dinner,2,5.14,William Riley,566287581219,Sun2546,William
11,35.26,5.00,Female,No,Sun,Dinner,4,8.82,Diane Macias,4577817359320969,Sun6686,Diane
12,15.42,1.57,Male,No,Sun,Dinner,2,7.71,Chad Harrington,577040572932,Sun1300,Chad
13,18.43,3.00,Male,No,Sun,Dinner,4,4.61,Joshua Jones,6011163105616890,Sun2971,Joshua
14,14.83,3.02,Female,No,Sun,Dinner,2,7.42,Vanessa Jones,30016702287574,Sun3848,Vanessa
15,21.58,3.92,Male,No,Sun,Dinner,2,10.79,Matthew Reilly,180073029785069,Sun1878,Matthew
16,10.33,1.67,Female,No,Sun,Dinner,3,3.44,Elizabeth Foster,4240025044626033,Sun9715,Elizabeth
17,16.29,3.71,Male,No,Sun,Dinner,3,5.43,John Pittman,6521340257218708,Sun2998,John
18,16.97,3.50,Female,No,Sun,Dinner,3,5.66,Laura Martinez,30422275171379,Sun2789,Laura
19,20.65,3.35,Male,No,Sat,Dinner,3,6.88,Timothy Oneal,6568069240986485,Sat9213,Timothy
20,17.92,4.08,Male,No,Sat,Dinner,2,8.96,Thomas Rice,4403296224639756,Sat1709,Thomas
21,20.29,2.75,Female,No,Sat,Dinner,2,10.14,Natalie Gardner,5448125351489749,Sat9618,Natalie
22,15.77,2.23,Female,No,Sat,Dinner,2,7.88,Ashley Shelton,3524119516293213,Sat9786,Ashley
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,Lance
24,19.82,3.18,Male,No,Sat,Dinner,2,9.91,Christopher Ross,36739148167928,Sat6236,Christopher

3. 2.Soruda yeni oluşturduğunuz 'JustName' sütunundaki verilerin her birinden kaç tane olduğuna uygun methodu kullanarak bakın.

In [72]:
df_tips["JustName"].unique()

array(['Christy', 'Douglas', 'Travis', 'Nathaniel', 'Tonya', 'Erik',
       'Kristopher', 'Robert', 'Joseph', 'Jerome', 'William', 'Diane',
       'Chad', 'Joshua', 'Vanessa', 'Matthew', 'Elizabeth', 'John',
       'Laura', 'Timothy', 'Thomas', 'Natalie', 'Ashley', 'Lance',
       'Christopher', 'Kyle', 'Patrick', 'David', 'Melinda', 'Grant',
       'Danny', 'Amanda', 'Amber', 'Jacob', 'Erin', 'Brandon', 'Mr.',
       'Adam', 'Bryan', 'Todd', 'Richard', 'James', 'Austin', 'Jeremiah',
       'Jessica', 'Emily', 'Curtis', 'Ronald', 'Michael', 'Melody',
       'Troy', 'Brian', 'Anthony', 'Ryan', 'Justin', 'Rachel', 'Tiffany',
       'Max', 'Teresa', 'Victoria', 'Julie', 'Kenneth', 'Mark', 'Chris',
       'Louis', 'Daniel', 'Jason', 'Shawna', 'Derek', 'Donald', 'Roger',
       'Keith', 'Earl', 'Leah', 'Jamie', 'Aaron', 'Eric', 'Edward',
       'Lori', 'Heather', 'Kathleen', 'Gabrielle', 'Karl', 'Steven',
       'Terri', 'Jeff', 'Katie', 'Kayla', 'Shawn', 'Linda', 'Dr.',
       'Melanie', 'Perry', 'Jordan', 'Angela', 'Mario', 'Christine',
       'Raymond', 'Seth', 'Taylor', 'Kaitlin', 'Karen', 'Rebecca',
       'Donna', 'Lindsey', 'Regina', 'Amy', 'Kelly', 'Annette', 'Luke',
       'Gregory', 'Madison', 'Jennifer', 'Charles', 'Audrey', 'Gordon',
       'Sara', 'Larry', 'Scott', 'Nathan', 'Walter', 'Jose', 'Stephen',
       'Heidi', 'Glenda', 'Riley', 'Kristy', 'Benjamin', 'Brooke',
       'Katherine', 'Abigail', 'Toni', 'Carly', 'Ricky', 'Sarah', 'Alex',
       'Robin', 'Marissa', 'Gary', 'Nicholas', 'Shelby', 'Leslie', 'Mary',
       'Whitney', 'Ruth', 'Glenn', 'Paul', 'Tracy', 'Sean', 'Kimberly',
       'Monica', 'Dennis', 'Michelle'], dtype=object)

In [73]:
df_tips["JustName"].nunique()

153

4. 3.Soruda gördüğünüz gibi JustName sütununda 'Jason' isminden 9 tane, 'Michael' isminden 7 tane , 'James' isminden 6 tane bulunuyor. Peki bunların hepsi gerçekten farklı kişiler mi ? Hemen 'Payer Name' sütunundaki verilerin adetlerini de saydırtarak bir kıyaslama yapın. 'JustName' sütununu kullanmanın faydasız ve yanıltıcı olabileceğini görün ardından oluşturduğumuz 'JustName' sütununu kalıcı olarak drop edin. (Oluşturmanız için bir pratikti bu sütun sadece :D)

In [74]:
df_tips["Payer Name"].nunique()

244

In [75]:
df_tips.drop("JustName", axis=1, inplace=True)
df_tips.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

5. Erkeklerin ve kadınların davranış patternlerini ayrı ayrı inceleyip yorumda bulunabilmek için 'df_male' ve 'df_female' adında 2 dataframe oluşturun. Birinde sadece 157 erkek verisi, diğerinde sadece 87 kadın verisi bulunsun.

In [77]:
df_male = df_tips[df_tips["sex"]=="Male"]
df_female = df_tips[df_tips["sex"]=="Female"]

In [78]:
df_male.head(10)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775
10,10.27,1.71,Male,No,Sun,Dinner,2,5.14,William Riley,566287581219,Sun2546
12,15.42,1.57,Male,No,Sun,Dinner,2,7.71,Chad Harrington,577040572932,Sun1300

In [79]:
df_female.head(10)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
11,35.26,5.00,Female,No,Sun,Dinner,4,8.82,Diane Macias,4577817359320969,Sun6686
14,14.83,3.02,Female,No,Sun,Dinner,2,7.42,Vanessa Jones,30016702287574,Sun3848
16,10.33,1.67,Female,No,Sun,Dinner,3,3.44,Elizabeth Foster,4240025044626033,Sun9715
18,16.97,3.50,Female,No,Sun,Dinner,3,5.66,Laura Martinez,30422275171379,Sun2789
21,20.29,2.75,Female,No,Sat,Dinner,2,10.14,Natalie Gardner,5448125351489749,Sat9618
22,15.77,2.23,Female,No,Sat,Dinner,2,7.88,Ashley Shelton,3524119516293213,Sat9786
29,19.65,3.00,Female,No,Sat,Dinner,2,9.82,Melinda Murphy,5489272944576051,Sat2467
32,15.06,3.00,Female,No,Sat,Dinner,2,7.53,Amanda Wilson,213186304291560,Sat1327

In [80]:
df_male.shape

(157, 11)

In [81]:
df_female.shape

(87, 11)

6. Ardından bu 'df_male' ile 'df_female' 'in ödedikleri bahşişler toplamını bulup karşılaştırın.

In [ ]:
# Kadınların ödedediği bahşişler toplamı

In [82]:
df_female["tip"].sum()

246.50999999999996

In [ ]:
# Erkeklerin ödedediği bahşişler toplamı

In [83]:
df_male["tip"].sum()

485.07

7. 6.Soruda erkeklerin ve kadınların ödedikleri bahşişler toplamına bakıldığında Erkeklerin kadınlara kıyasla toplamda daha çok bahşiş ödediğini görüyoruz. Fakat biz biliyoruz ki bizim verimizde 157 Erkek, 87 kadın verisi vardı. Dolayısıyla Erkek sayısı daha fazla olduğu için toplam ödeyecekleri bahşiş miktarlarında da daha fazla çıkması oldukça normal bir durum. Bu yüzden daha mantıklı bir çıkarım için bu sefer df_male ile df_female'in bahşiş ORTALAMALARIN'a bakıp kıyaslayın, aralarında anlamlı ve ciddi bir fark var mı ?

In [84]:
# Kadınların ödedediği bahşişlerin ortalaması

In [85]:
df_female["tip"].mean()

2.8334482758620685

In [86]:
# Erkeklerin ödedediği bahşişlerin ortalaması

In [87]:
df_male["tip"].mean()

3.0896178343949043

8. Oluşturmuş olduğunuz df_male ile çalışarak elimizdeki verideki erkeklerin yüzde kaçının sigara içtiğini bulun. Aynı şekilde elimizdeki kadınların yüzde kaçının sigara içtiğini de bulun. Aralarında anlamlı bir fark mı yorumlayın.

In [ ]:
# Erkeklerin sigara içme oranı:

In [97]:
erkeklerin_sigara_yuzdesi = (df_male[df_male["smoker"]=="Yes"].shape[0]/df_male.shape[0])*100
erkeklerin_sigara_yuzdesi

38.21656050955414

In [98]:
# Kadınların sigara içme oranı:

In [100]:
kadinlarin_sigara_yuzdesi = (df_female[df_female["smoker"]=="Yes"].shape[0]/df_female.shape[0])*100
kadinlarin_sigara_yuzdesi

37.93103448275862

9. Erkeklerin zaman olarak dinnerda mı yoksa lunch'da mı daha fazla yemek yediğini yüzdesel olarak bulun. Aynı işlemi kadınlar için de yapın. Yüzdesel olarak erkeklerin ve kadınların yemek yeme vakitleri arasında anlamlı bir fark var mı yok mu yorumlayın.

In [112]:
erkek_toplam = df_male["total_bill"].sum()
erkek_toplam

3256.8199999999997

In [108]:
df_male.groupby("time")["total_bill"].sum()

time
Dinner    2661.22
Lunch      595.60
Name: total_bill, dtype: float64

In [115]:
erkek_yuzde = (df_male.groupby("time")["total_bill"].sum() / erkek_toplam)*100
erkek_yuzde
# erkeklerin %81.7 gibi fazla bir oranı dinner da dışarıda yemek yemeyi tercih ediyormuş.

time
Dinner    81.712222
Lunch     18.287778
Name: total_bill, dtype: float64

In [116]:
kadin_toplam = df_female["total_bill"].sum()
kadin_toplam

1570.9499999999996

In [117]:
df_female.groupby("time")["total_bill"].sum()

time
Dinner    999.08
Lunch     571.87
Name: total_bill, dtype: float64

In [118]:
kadin_yuzde = (df_female.groupby("time")["total_bill"].sum() / kadin_toplam)*100
kadin_yuzde
# Erkekler olmasa da kadınların büyük çoğunluğu dinner da fazla para harcıyorlar.

time
Dinner    63.597186
Lunch     36.402814
Name: total_bill, dtype: float64

10. CC Number sütununu kalıcı olarak drop edin. Ardından df'in içindeki sütunların birbirleriyle olan ilişkilerini inceleyin ve çıkan sonuçlar hakkında yorumlarınızı belirtin.

In [119]:
df_tips.drop("CC Number", axis=1, inplace=True)

In [120]:
df_tips.head(10)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,Sun2251
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,Sun9679
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,Sun5985
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,Sun8157
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,Sun6820
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,Sun3775

In [128]:
df_tips[["total_bill", "tip", "size", "price_per_person"]].corr()

                  total_bill       tip      size  price_per_person
total_bill          1.000000  0.675734  0.598315          0.647554
tip                 0.675734  1.000000  0.489299          0.347405
size                0.598315  0.489299  1.000000         -0.175359
price_per_person    0.647554  0.347405 -0.175359          1.000000

In [ ]:
# toplam fatura arttıkça tip seviyesi artıyor. Size ve price per persona göre total bill artıyor.
# price per person ile size arasında negarif bir ilişki var yani size sayısı arttıkça price per person azalıyor diyebiliriz.